- 조회메시지
    - 이름: 서버 혹은 메일 목적지
        - www.example.co.kr
    - 클래스: 현재는 인터넷을 나타내는 `IN`만 존재
    - 타입: 어떤 정보가 지원되는지
        - A: ip 주소 조회
        - MX: 메일 목적지 조회
        - CNAME: 별칭 사용
        - NS: DNS 서버의 IP주소 등록

리소스 레코드에서 이름, 클래스, 타입이 일치하는 정보를 찾아 데이터를 반환

도메인 계층

- www.cyber.co.kr.
    - . → 루트 도메인(일반적으로 생략)이 가지고 있는 IP주소는 전세계에 13개 존재
    - kr → 대한민국을 나타내는 최상위 계층
    - co → 회사를 나태낸다
    - cyber → 회사에 할당된 도메인
    - www → 서버의 이름으로 최하위 계층

1. 가까운 DNS 서버에 조회
2. 등록되어 있지 않은 경우 루트도메인 주소를 알고 있으므로 루트 도메인 DNS 서버로 이동
3. 도메인 계층에 따라 순차적으로 이동
4. 원하는 DNS 서버에 도착해 ip주소를 획득

캐시

- 한 번 조회한 정보를 캐시에 저장해 빠르게 회답
- 캐시에 저장한 후 등록정보가 변경되어 버리면 올바른 ip 주소를 반환하지 못하므로 주의